app/views/comments/new.html.erb

SELECT "stores".* FROM "stores"
---
    <%= f.label :store_id, "Restaurant"%>
    <%= f.collection_select(:store_id, Store.all, :id, :store_number) %>