app/views/comments/show.html.erb


        <p><%= @comment.guest.first_name %> <%= @comment.guest.last_name %></p>
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

        <p><%= @comment.visit_time.strftime("%I:%M%p")  %> <%= @comment.comment_type %></p>
        <% if !@comment.comment_updates.empty? %>
                <h2>Updates</h2>
                <% @comment.comment_updates.each do |u| %>
---
SELECT "comment_updates".* FROM "comment_updates" WHERE "comment_updates"."comment_id" = ?  [["comment_id", 2]]
SELECT  1 AS one FROM "comment_updates" WHERE "comment_updates"."comment_id" = ? LIMIT ?  [["comment_id", 1], ["LIMIT", 1]]