app/views/comments/update.html.erb

<p>Restaurant #: <%= link_to @comment.store.store_number, store_path(@comment.store) %> Date: <%= @comment.visit_date.strftime("%m/%d/%Y") %> Time: <%= @comment.visit_time.strftime("%I:%M%p") %><br>
    Guest: <%= link_to @comment.guest.first_name + " " + @comment.guest.last_name, guest_path(@comment.guest) %> Phone: <%= number_to_phone(@comment.guest.phone) %><br>
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]