app/views/stores/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."store_id" = ?  [["store_id", 1]]
---
    <p><%= store.store_number %> - <%= store.name %><br>
    Comments: <%= store.comments.count  %></p>