app/controllers/comment_updates_controller.rb

INSERT INTO "comment_updates" ("comment_id", "update_date", "update_type", "current_update", "employee_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "comments" SET "status" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["status", "Closed"], ["updated_at", "2018-09-25 01:13:27.075557"], ["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "status" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["status", "Closed"], ["updated_at", "2018-09-26 15:21:54.427358"], ["id", 2]]
---
    def create
        binding.pry
        @update = CommentUpdate.create(update_params)
        @update.save
        if params[:comment][:status] == "Closed"
            comment = Comment.find(params[:comment_update][:comment_id])
            comment.status = "Closed"
            comment.save