app/controllers/comments_controller.rb

INSERT INTO "guests" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "r@y.com"], ["created_at", "2018-09-24 21:17:52.040275"], ["updated_at", "2018-09-24 21:17:52.040275"]]
SELECT  "guests".* FROM "guests" WHERE "guests"."email" = ? LIMIT ?  [["email", "r@y.com"], ["LIMIT", 1]]
UPDATE "guests" SET "first_name" = ?, "last_name" = ?, "phone" = ?, "updated_at" = ? WHERE "guests"."id" = ?  [["first_name", "Mina"], ["last_name", "Gomez"], ["phone", "2107773333"], ["updated_at", "2018-09-24 21:17:52.057548"], ["id", 3]]
INSERT INTO "comments" ("visit_date", "visit_time", "comment_type", "source", "urgent", "case_number", "first_issue", "first_issue_comment", "second_issue", "second_issue_comment", "third_issue", "third_issue_comment", "contact_type", "visit_type", "employee_named", "status", "guest_id", "store_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @guest = Guest.find_or_create_by(email: params[:guest][:email])
        @guest.update(guest_params)
        @comment = Comment.create(comment_params)
        @comment.guest_id = @guest.id
        @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def update
        @update = CommentUpdate.new
        @comment = Comment.find(params[:id])