app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores"
---
    def index
        @store = Store.all