app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)
        binding.pry
        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("first_name", "last_name", "position", "username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)