app/views/comment_updates/new.html.erb

    <%= u.label :comment_id, "Case Number"%>
    <%= u.collection_select(:comment_id, Comment.all, :id, :case_number) %>
---
SELECT "comments".* FROM "comments"